Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Free and open-source under MIT license
it_it: Gratuito e open source con licenza MIT

source: Free any allocated resources
it_it: Libera tutte le risorse allocate

source: Free for commercial projects
it_it: Gratuito per progetti commerciali

source: FreeType Font Engine
it_it: Motore del Font FreeType

source: FreeType can be used in LVGL as described in :ref:`Freetype <freetype>`.
it_it: FreeType può essere utilizzato in LVGL come descritto in :ref:`Freetype <freetype>`.

source: FreeType fonts use the :ref:`freetype` engine to load TTF files directly.
it_it: I font FreeType utilizzano il motore :ref:`freetype` per caricare direttamente i file TTF.

source: FreeType integration does not currently support kerning.
it_it: L'integrazione con FreeType attualmente non supporta il "kerning" [crenatura].

source: Freeing the Image
it_it: Liberazione dell'Immagine

source: Freetype font kerning
it_it: Crenatura dei font FreeType

source: From Data
it_it: Dai Dati

source: From File
it_it: Da File

source: From GitHub
it_it: Da GitHub

source: From Your Local Workstation
it_it: Dalla Workstation Locale

source: From ``globals.xml``, four files are created:
it_it: Da ``globals.xml``, vengono creati quattro file:

source: From an object-oriented perspective, think of the Base Widget as the widget class from which all other widgets inherit.
it_it: Da una prospettiva object-oriented, si può pensare al Widget Base come alla classe widget da cui ereditano tutti gli altri.

source: From file: :cpp:expr:`lv_xml_test_register_from_file("path/to/test.xml", "A:ref_images")`
it_it: Da file: :cpp:expr:`lv_xml_test_register_from_file("path/to/test.xml", "A:ref_images")`

source: From here, you can use the relevant LVGL ``lv_rlottie...()`` functions to create lottie animations in LVGL on embedded hardware!
it_it: Da qui, è possibile utilizzare le funzioni LVGL ``lv_rlottie...()`` pertinenti per creare animazioni lottie in LVGL su hardware embedded!

source: From here, you should be able to use lv_rlottie objects in your ESP-IDF project as any other widget in LVGL ESP examples.
it_it: Da qui, si dovrebbe essere in grado di utilizzare gli oggetti lv_rlottie nel progetto ESP-IDF come qualsiasi altro widget negli esempi ESP LVGL.

source: From string: :cpp:expr:`lv_xml_test_register_from_data(xml_data, "A:ref_images")`
it_it: Da stringa: :cpp:expr:`lv_xml_test_register_from_data(xml_data, "A:ref_images")`

source: From that log you can examine the state of the Widget Tree when :cpp:expr:`lv_obj_dump_tree(widget)` was called.
it_it: Da quel log è possibile esaminare lo stato del Widget Tree quando è stato chiamato :cpp:expr:`lv_obj_dump_tree(widget)`.

source: From the XML files, the Editor can export C code that can be embedded into the firmware just like any handwritten C code.
it_it: Dai file XML, l'Editor può esportare codice C che può essere incorporato nel firmware proprio come qualsiasi codice C scritto a mano.

source: From the XMLs of screens and components, "create" functions are generated using the name of the file.
it_it: Dai file XML di schermate e componenti, vengono generate funzioni "create" utilizzando il nome del file.

source: From the `Wikipedia <https://en.wikipedia.org/wiki/MIPI_Alliance>`__:
it_it: Da `Wikipedia <https://en.wikipedia.org/wiki/MIPI_Alliance>`__:

source: From time to time you may need to retrieve the *scroll position* of a scrollable Widget, either to restore it later, or to dynamically display some elements according to its current scroll position.
it_it: Di tanto in tanto potrebbe essere necessario recuperare la *posizione di scorrimento* di un widget scorrevole, per ripristinarla in seguito o per visualizzarne dinamicamente alcuni elementi in base alla loro posizione corrente dello scorrimento.

source: Full POSIX compatibility
it_it: Compatibilità POSIX completa

source: Full image
it_it: Immagine intera

source: Full initialisation with mouse pointer symbol and own application exit handling
it_it: Inizializzazione completa con simbolo del puntatore del mouse e gestione dell'uscita dall'applicazione

source: Full keyboard support needs to be enabled separately.
it_it: Il supporto completo della tastiera deve essere abilitato separatamente.

source: Full keyboards with all the letters or simple keypads with a few navigation buttons belong in the *Keypad* category.
it_it: Le tastiere complete con tutte le lettere o i "keypad" [tastierini] semplici con pochi pulsanti di navigazione appartengono alla categoria *Keypad*.

source: Full transparency support with alpha blending
it_it: Supporto completo della trasparenza con alfa blending

source: Full width/height of the widget.
it_it: Larghezza/altezza totale del widget.

source: Fullscreen mode
it_it: Modalità fullscreen

source: Fully customizable graphic elements with CSS-like styles
it_it: Elementi grafici completamente personalizzabili con stili simili a CSS

source: Fully support LVGL animations
it_it: Supporta pienamente le animazioni LVGL

source: Fully support LVGL flex and grid styles
it_it: Supporta pienamente gli stili flex e grid LVGL

source: Function
it_it: Funzione

source: Function calls, subject changes, or screen load/create events can be added.
it_it: È possibile aggiungere chiamate di funzione, modifiche dell'oggetto o eventi di caricamento/creazione dello schermo.

source: Function execution time displayed as 0s in Perfetto
it_it: Tempo di esecuzione della funzione visualizzato come 0 secondi in Perfetto

source: Functions
it_it: Funzioni

source: Functions and ``struct``\ s which are not part of the public API must begin with underscore in order to mark them as "private".
it_it: Le funzioni e le ``struct`` che non fanno parte dell'API pubblica devono iniziare con un carattere di sottolineatura per essere contrassegnate come "private".

source: Functions for arc drawing:
it_it: Funzioni per il disegno dell'arco:

source: Functions for blur drawing:
it_it: Funzioni per il disegno della sfocatura:

source: Functions for image drawing:
it_it: Funzioni per il disegno di immagini:

source: Functions for line drawing:
it_it: Funzioni per il disegno di linee:

source: Functions for text drawing:
it_it: Funzioni per il disegno di testo:

source: Functions for triangle drawing:
it_it: Funzioni per il disegno del triangolo:

source: Functions such as :cpp:expr:`lv_draw_rect()` and :cpp:expr:`lv_draw_label()` create one or more Draw Tasks and pass them down the Drawing Pipeline.
it_it: Funzioni come :cpp:expr:`lv_draw_rect()` e :cpp:expr:`lv_draw_label()` creano una o più Draw Task e le passano lungo la Pipeline di Disegno.

source: Functions such as :cpp:func:`lv_obj_set_pos` and :cpp:func:`lv_obj_set_size` cannot be used on screens.
it_it: Funzioni come :cpp:func:`lv_obj_set_pos` e :cpp:func:`lv_obj_set_size` non possono essere utilizzate sugli Screen.

source: Functions that add something to the message box return a pointer to the newly added Widget:
it_it: Le funzioni che aggiungono qualcosa alla finestra di messaggio restituiscono un puntatore al Widget appena aggiunto:

source: Functions:
it_it: Funzioni:

source: Further Reading
it_it: Ulteriori Informazioni

source: Further Reading on Callbacks
it_it: Ulteriori Approfondimenti sulle Callback

source: Further Reading on Memory Management
it_it: Ulteriori Informazioni sulla Gestione della Memoria

source: Further details of specific enforcement policies may be posted separately.
it_it: Ulteriori dettagli su specifiche policy di applicazione potrebbero essere pubblicati separatamente.

source: Furthermore, STM32CubeCLT is a toolset for integrating ST proprietary tools into other IDEs such as Visual Studio Code.
it_it: Inoltre, STM32CubeCLT è un set di tool per integrare quelli proprietari di ST in altri IDE come Visual Studio Code.

source: Furthermore, suppose your recipe is named foo_1.3.0-r0.bb.
it_it: Inoltre, supponiamo che la ricetta si chiami foo_1.3.0-r0.bb.

source: Furthermore, the DCS specification contains a standard command set, which is supported by a large number of legacy TFT LCD controllers, including the popular Sitronix (ST7735, ST7789, ST7796) and Ilitek (ILI9341) SOCs.
it_it: Inoltre, la specifica DCS contiene un set di comandi standard, supportato da un gran numero di controller LCD TFT legacy, inclusi i popolari SOC Sitronix (ST7735, ST7789, ST7796) e Ilitek (ILI9341).

source: G2D Backend
it_it: Backend G2D

source: G2D accelerator
it_it: Acceleratore G2D

source: G2D draw initialization is done automatically in :cpp:func:`lv_init` once the G2D is enabled as a draw unit , no user code is required:
it_it: L'inizializzazione del disegno G2D viene eseguita automaticamente in :cpp:func:`lv_init` una volta che G2D è abilitato come unità di disegno, non è richiesto alcun codice utente:

source: G2D library and drivers installed on the system
it_it: Libreria e driver G2D installati sul sistema

source: G2D/PXP can only rotate at 90\ |deg| angles.
it_it: G2D/PXP può ruotare solo ad angoli di 90\ |deg|.

source: G2D/PXP is set to process 16x16 blocks to optimize the system for memory bandwidth and image processing time.
it_it: G2D/PXP è impostato per elaborare blocchi 16x16 per ottimizzare il sistema in termini di larghezza di banda di memoria e tempo di elaborazione delle immagini.

source: G2L and G2UL
it_it: G2L e G2UL

source: GC is aware of most allocations, except from pointers to the `Data Segment <https://en.wikipedia.org/wiki/Data_segment>`__:
it_it: Il GC riconosce la maggior parte delle allocazioni, ad eccezione dei puntatori al `Data Segment <https://en.wikipedia.org/wiki/Data_segment>`__:

source: GDB Plug-In
it_it: Plug-In GDB

source: GIF Decoder
it_it: Decoder GIF

source: GLCDC is a multi-stage graphics output peripheral available in several Renesas MCUs.
it_it: GLCDC è una periferica di uscita grafica multistadio disponibile in diversi MCU Renesas.

source: GLCDC is a multi-stage graphics output peripheral used in Renesas MCUs.
it_it: GLCDC è una periferica di output grafico multistadio utilizzata nei microcontrollori Renesas.

source: GLFW (see :ref:`GLFW driver <glfw_driver>`)
it_it: GLFW (vedere il :ref:`driver GLFW <glfw_driver>`)

source: GLFW Driver
it_it: Driver GLFW

source: GPU Acceleration
it_it: Accelerazione GPU

source: GPU Input Formats
it_it: Formati di Input GPU

source: GStreamer supports a wide variety of media formats through its plugin system:
it_it: GStreamer supporta un'ampia varietà di formati multimediali tramite il suo sistema di plugin:

source: GStreamer's ``uridecodebin`` automatically selects the appropriate source element and decoder based on the URI scheme and media format.
it_it: ``uridecodebin`` di GStreamer seleziona automaticamente l'elemento sorgente e il decoder appropriati in base allo schema URI e al formato multimediale.

source: GUI demos to demonstrate your board graphics capacities.
it_it: Delle demo della GUI per dimostrare le capacità grafiche della scheda.

source: Gateway Thread
it_it: Thread Gateway

source: Gather basic information about the image and store it in ``header``.
it_it: Raccoglie le informazioni di base sull'immagine e le memorizza in ``header``.

source: Generally speaking, file buffering can be optimized for different kinds of access patterns.
it_it: In generale, il buffering dei file può essere ottimizzato per diversi tipi di modelli di accesso.

source: Generate C and H files from XMLs:
it_it: Generare file C e H da XML:

source: Generate C code from XML files
it_it: Generazione di codice C da file XML

source: Generate SDK and set up environment
it_it: Generare l'SDK e configurare l'ambiente

source: Generate XMLs using the LVGL UI editor.
it_it: Generare file XML utilizzando l'LVGL UI editor.

source: Generate an SDK that you can use to cross-compile the application for the target (RPi4).
it_it: Generare un SDK utilizzabile per la cross-compilazione dell'applicazione per il target (RPi4).

source: Generate code from XML.
it_it: Generare codice da XML.

source: Generated C and H files containing all subject, font, image, style, and other initializations.
it_it: File C e H generati contenenti tutte le inizializzazioni di oggetti, font, immagini, stili e altre.

source: Generates a dot clock to the panel.
it_it: Genera un dot clock per il pannello.

source: Generating LZ4 Compressed Binary Images
it_it: Generazione di Immagini Binarie Compresse LZ4

source: Generating RLE Compressed Binary Images
it_it: Generazione di Immagini Binarie Compresse con RLE

source: Generating a Software Development Kit (SDK) in Yocto serves several important purposes, particularly in embedded development:
it_it: La generazione di un Software Development Kit (SDK) in Yocto svolge diverse funzioni importanti, in particolare nello sviluppo embedded:

source: Generic (pure Python):
it_it: Generici (Python puro):

source: Generic Linux Port
it_it: Porting Linux Generico

source: Generic MIPI DCS-Compatible LCD Controller Driver
it_it: Driver generico per controller LCD compatibile con MIPI DCS

source: Generic OpenGL Driver
it_it: Driver Generico OpenGL

source: Gestures
it_it: Gesti

source: Get Buildroot
it_it: Ottenere Buildroot

source: Get it from `GitHub <https://github.com/jkent/frogfs>`__ with ``git clone``.
it_it: Scaricarlo da `GitHub <https://github.com/jkent/frogfs>`__ con ``git clone``.

source: Get selected option
it_it: Prelevare l'opzione selezionata

source: Get some basic info about the image (width, height and color format).
it_it: Ottiene alcune informazioni di base sull'immagine (larghezza, altezza e formato del colore).

source: Get the IP address of the development host and open a remote shell on the device.
it_it: Ottenere l'indirizzo IP dell'host di sviluppo e aprire una shell remota sul dispositivo.

source: Get the LVGL Arduino library
it_it: Ottenere la libreria LVGL per Arduino

source: Get the LVGL library
it_it: Ottenere la libreria LVGL

source: Get the animation
it_it: Ottenere l'animazione

source: Get the gesture with :cpp:expr:`lv_indev_get_gesture_dir(lv_indev_active())`
it_it: Il gesto si ottiene con :cpp:expr:`lv_indev_get_gesture_dir(lv_indev_active())`

source: Get the key with :cpp:expr:`lv_indev_get_key(lv_indev_active())`
it_it: Si ottiene il tasto con :cpp:expr:`lv_indev_get_key(lv_indev_active())`

source: Get the number of steps using :cpp:expr:`lv_xml_test_get_step_count()` and then call :cpp:expr:`lv_xml_test_run_next(slowdown)` as many times.
it_it: Ottiene il numero di passi usando :cpp:expr:`lv_xml_test_get_step_count()` e poi chiama :cpp:expr:`lv_xml_test_run_next(slowdown)` altrettante volte.

source: Get the repository
it_it: Ottenere il repository

source: Get to know like-minded people and make something great together.
it_it: Si incontrano persone che la pensano in modo simile e si crea qualcosa di grande insieme.

source: Get to the "Manage Solution" view from the CMSIS Solution extension.
it_it: Accedere alla vista "Manage Solution" dall'estensione CMSIS Solution.

source: Getter functions return ``LV_RESULT_INVALID`` if called outside the event callback, ensuring you never read stale data
it_it: Le funzioni getter restituiscono ``LV_RESULT_INVALID`` se chiamate al di fuori della callback dell'evento, garantendo che non vengano mai letti dati obsoleti.

source: Getting Animations
it_it: Ottenere Animazioni

source: Getting LVGL
it_it: Ottenere LVGL

source: Getting Started with AC6
it_it: Introduzione a AC6

source: Getting Started with DRM
it_it: Introduzione a DRM

source: Getting Started with GLFW
it_it: Introduzione a GLFW

source: Getting Started with OpenGL
it_it: Introduzione a OpenGL

source: Getting a Subject's Previous Value
it_it: Ottenere il Valore Precedente di un Subject

source: Getting a Subject's Value
it_it: Ottenere il valore di un Subject

source: Getting familiar with Torizon Cloud and Torizon OS builder is also recommended when you get closer to production.
it_it: Si consiglia inoltre di familiarizzare con Torizon Cloud e Torizon OS Builder quando ci si avvicina alla produzione.

source: Getting started
it_it: Per iniziare

source: Getting started in Yocto can be overwheming.
it_it: Iniziare a usare Yocto può essere complicato.

source: Getting the Current Layer
it_it: Ottenere il Layer Corrente

source: Getting the Test Results
it_it: Ottenere i Risultati del Test

source: Getting the parts
it_it: Ottenere le parti

source: GitHub Codespaces offer a cloud-hosted VSCode environment that runs entirely in the browser.
it_it: GitHub Codespaces offre un ambiente VSCode ospitato sul cloud eseguito interamente nel browser.

source: Given an Animation's ``start`` and ``end`` values, *rate* here means the number of units of change per second, i.e. how quickly (units per second) the Animation's value needs to change between the ``start`` and ``end`` value.
it_it: Dati i valori ``start`` e ``end`` di un'Animazione, *rate* qui indica il numero di unità di variazione al secondo, ovvero la velocità (unità al secondo) con cui il valore dell'animazione deve cambiare tra il valore ``start`` e ``end``.

source: Global data
it_it: Dati globali

source: Global memory monitor (``sysmon_mem``)
it_it: Monitoraggio della memoria globale (``sysmon_mem``)

source: Global names (API):
it_it: Nomi globali (API):

source: Go to :ref:`flash_the_image` to test the system.
it_it: Andare su :ref:`flash_the_image` per testare il sistema.

source: Go to ``Libraries``.
it_it: Andare su ``Libraries``.

source: Go to ``lvgl`` and copy ``lv_conf_template.h`` as ``lv_conf.h`` into the Arduino Libraries directory next to the ``lvgl`` library folder.
it_it: Andare a ``lvgl`` e copiare ``lv_conf_template.h`` come ``lv_conf.h`` nella directory delle Librerie Arduino accanto alla cartella delle librerie di ``lvgl``.

source: Go to go to ``Help`` -> ``Add Renesas Toolchains``
it_it: Si va su ``Help`` -> ``Add Renesas Toolchains``

source: Go to https://lvgl.io/tools/fontconverter
it_it: Andare su https://lvgl.io/tools/fontconverter

source: Go to the directory of the installed Arduino libraries
it_it: Andare alla directory delle librerie installate di Arduino

source: Go to the menu: Help -> Install New Software...
it_it: Accedere al menù: Help -> Install New Software...

source: Gracefully accepting constructive criticism
it_it: Accettare con garbo le critiche costruttive

source: Gradient and image fills are not supported yet, as well as dashed strokes.
it_it: I riempimenti a gradienti e con immagini non sono ancora supportati, così come le linee tratteggiate.

source: Gradient drawing includes linear gradients and radial gradients.
it_it: Il disegno di gradienti include gradienti lineari e radiali.

source: Gradient options.
it_it: Opzioni del gradiente.

source: Gradients
it_it: Gradienti

source: Gradients for button background
it_it: Gradienti per lo sfondo del pulsante

source: Gray-scale displays
it_it: Display in scala di grigi

source: Grid Navigation
it_it: Navigazione a Griglia

source: Grid align
it_it: Allineamento nella Grid

source: Grid descriptors
it_it: Descrittori di Grid

source: Grid items
it_it: Elementi della Grid

source: Grid layout properties.
it_it: Proprietà del layout della griglia.

source: Grid navigation
it_it: Navigazione a Griglia

source: Grid navigation (gridnav for short) is a feature that moves focus among a set of child Widgets via arrow-key presses.
it_it: La "Grid navigation" [navigazione a griglia] (gridnav in breve) è una funzionalità che sposta il focus tra un insieme di Widget figli tramite la pressione dei tasti freccia.

source: Grid navigation for only one axis
it_it: Grid navigation per un solo asse

source: Grid navigation on a list
it_it: Grid navigation in una lista

source: Grid: arranges child Widgets into fixed positions in a 2D table.
it_it: Grid: organizza i widget secondari in posizioni fisse in una tabella 2D.

source: Gridnav also works if the children are arranged into a single row or column.
it_it: Gridnav funziona anche se i figli sono disposti in una singola riga o colonna.

source: Gridnav assumes that the Widget to which gridnav is added is part of a :ref:`group <indev_groups>`.
it_it: Gridnav presuppone che il Widget a cui viene aggiunto faccia parte di un :ref:`gruppo <indev_groups>`.

source: Group
it_it: Gruppo

source: Groups
it_it: Gruppi

source: Groups are a "group of widgets" that can be focused by :ref:`Keypad <indev_keypad>` or :ref:`Encoder <indev_encoder>` input devices.
it_it: I gruppi sono "gruppi di widget" that che possono ottenere il focus dai dispositivi di input :ref:`Keypad <indev_keypad>` o :ref:`Encoder <indev_encoder>`.

source: Guides
it_it: Guide

source: Gummy button
it_it: Pulsante gommoso

source: HDMI Displays
it_it: Display HDMI

source: HP and HE Cores and Optimized Build
it_it: I Core HP e HE e Build Ottimizzata

source: HW acceleration for NXP iMX RT platforms
it_it: Accelerazione HW per piattaforme NXP iMX RT

source: HW acceleration for NXP iMX platforms
it_it: Accelerazione HW per piattaforme NXP iMX

source: Handle GStreamer events using LVGL's event system:
it_it: Gli eventi GStreamer si gestiscono utilizzando il sistema di eventi di LVGL:

source: Handle multiple events
it_it: Gestione di eventi multipli

source: Handles for input devices of each display can be obtained using ``lv_wayland_get_indev_keyboard()``, ``lv_wayland_get_indev_touchscreen()``, ``lv_wayland_get_indev_pointer()`` and ``lv_wayland_get_indev_pointeraxis()`` respectively.
it_it: Gli handle per i dispositivi di input di ciascun display possono essere ottenuti utilizzando rispettivamente ``lv_wayland_get_indev_keyboard()``, ``lv_wayland_get_indev_touchscreen()``, ``lv_wayland_get_indev_pointer()`` e ``lv_wayland_get_indev_pointeraxis()``.

source: Handling large numbers of points
it_it: Gestione di un numero elevato di punti

source: Handling login and its states
it_it: Gestire l'accesso e i suoi stati

source: Hardware Button
it_it: Pulsante Hardware

source: Hardware and software components can be modified in a visual way using the ``Configuration Window``.
it_it: I componenti hardware e software possono essere modificati visivamente utilizzando la ``Configuration Window``.

source: Hardware independent: use with any microcontroller or display
it_it: Indipendente dall'hardware: utilizzabile con qualsiasi microcontrollore o display

source: Hardware with G2D support (e.g., NXP i.MX6/i.MX8 series)
it_it: Hardware con supporto G2D (ad esempio, serie NXP i.MX6/i.MX8)

source: Hardware-accelerated rendering
it_it: Rendering con accelerazione hardware

source: Has rich components and a prosperous and fast growing `package ecosystem <https://packages.rt-thread.org/en/>`__
it_it: Ha componenti ricchi e un `ecosistema di pacchetti <https://packages.rt-thread.org/en/>`__ prospero e in rapida crescita

source: Have a "normal" TFT display with local UI and create "virtual" screens on VNC on demand.
it_it: Avere un display TFT "normale" con interfaccia utente locale e creare schermi "virtuali" su VNC su richiesta.

source: Have a large TFT display and a small monochrome display.
it_it: Avere un display TFT di grandi dimensioni e un piccolo display monocromatico.

source: Have a look at some :ref:`examples` and their code.
it_it: Consultare alcuni :ref:`examples` e il relativo codice.

source: Have some smaller and simple displays in a large instrument or technology.
it_it: Avere alcuni display più piccoli e semplici in uno strumento o dispositivo tecnologico di grandi dimensioni.

source: Have two large TFT displays: one for a customer and one for the shop assistant.
it_it: Avere due display TFT di grandi dimensioni: uno per il cliente e uno per il commesso.
